app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
    <h2><%= location.name %></h2>
    <% location.books.each do |book| %>